// напишіть функцію яка отримуватиме два числа та колбек який має обробити цих два числа
// схематично це вигляд наступним чимно
// ви передаєте два числа, та функцію-колбек яка вміє отримувати два числа та повернути їх суму або інші математичні дії


/*
  sum - додавання
  sub - віднімання
  mult - множення
  div - ділення
*/

/* 
  - 1 зробіть голову функцію math()
  - 2 зробіть кілька функцій які отримують два числа та повертають результат математичної дії між ними
  - sum() - повертатиме суму тих чисел які отримує
  - sub() - повертатиме різницю тих чисел які отримує
	і так дальше
  ! функції для обрахування запишіть у форматі стрілкових функцій
  
  - 3 зробіть функцію яка логуватиме результат виклику
  - 4 поверніть результат виконання головної функції та виведіть його у консоль
*/
let a = 2;
let b = 4;


const sum = (a, b) => {
  return a + b;
}

const sub = (a, b) => {
  return a - b;
}

const mult = (a, b) => {
  return a * b;
}

const div = (a, b) => {
  return a / b;
}



function resultLog() {
  console.log(`result`)
}

function math(a, b, callback) {
  let result = callback(a, b)
  resultLog(result);
}

math(2, 5, mult)
